{
  "format": "layers-model",
  "generatedBy": "keras v2.8.0",
  "convertedBy": "TensorFlow.js Converter v3.13.0",
  "modelTopology": {
    "keras_version": "2.8.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_1",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 48, 48, 1],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "conv2d_1_input"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_1",
              "trainable": true,
              "batch_input_shape": [null, 48, 48, 1],
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [5, 5],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_2",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [5, 5],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_1",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_1",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_3",
              "trainable": true,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [5, 5],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_4",
              "trainable": true,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [5, 5],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_2",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_2",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_5",
              "trainable": true,
              "dtype": "float32",
              "filters": 256,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_6",
              "trainable": true,
              "dtype": "float32",
              "filters": 256,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_3",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_3",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten_1",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 128,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_4",
              "trainable": true,
              "dtype": "float32",
              "axis": [1],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            }
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "activation_1",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_1",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.2,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 7,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "activation_2",
              "trainable": true,
              "dtype": "float32",
              "activation": "softmax"
            }
          }
        ]
      }
    },
    "training_config": {
      "loss": "categorical_crossentropy",
      "metrics": [
        [
          {
            "class_name": "MeanMetricWrapper",
            "config": {
              "name": "accuracy",
              "dtype": "float32",
              "fn": "categorical_accuracy"
            }
          }
        ]
      ],
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "Adam",
          "learning_rate": 0.0010000000474974513,
          "decay": 0.0,
          "beta_1": 0.8999999761581421,
          "beta_2": 0.9990000128746033,
          "epsilon": 1e-7,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of3.bin",
        "group1-shard2of3.bin",
        "group1-shard3of3.bin"
      ],
      "weights": [
        {
          "name": "batch_normalization_1/gamma",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/beta",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/moving_mean",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/moving_variance",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/gamma",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/beta",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/moving_mean",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/moving_variance",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_3/gamma",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_3/beta",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_3/moving_mean",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_3/moving_variance",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_4/gamma",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_4/beta",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_4/moving_mean",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_4/moving_variance",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "conv2d_1/kernel",
          "shape": [5, 5, 1, 64],
          "dtype": "float32"
        },
        { "name": "conv2d_1/bias", "shape": [64], "dtype": "float32" },
        {
          "name": "conv2d_2/kernel",
          "shape": [5, 5, 64, 64],
          "dtype": "float32"
        },
        { "name": "conv2d_2/bias", "shape": [64], "dtype": "float32" },
        {
          "name": "conv2d_3/kernel",
          "shape": [5, 5, 64, 128],
          "dtype": "float32"
        },
        { "name": "conv2d_3/bias", "shape": [128], "dtype": "float32" },
        {
          "name": "conv2d_4/kernel",
          "shape": [5, 5, 128, 128],
          "dtype": "float32"
        },
        { "name": "conv2d_4/bias", "shape": [128], "dtype": "float32" },
        {
          "name": "conv2d_5/kernel",
          "shape": [3, 3, 128, 256],
          "dtype": "float32"
        },
        { "name": "conv2d_5/bias", "shape": [256], "dtype": "float32" },
        {
          "name": "conv2d_6/kernel",
          "shape": [3, 3, 256, 256],
          "dtype": "float32"
        },
        { "name": "conv2d_6/bias", "shape": [256], "dtype": "float32" },
        { "name": "dense_1/kernel", "shape": [9216, 128], "dtype": "float32" },
        { "name": "dense_1/bias", "shape": [128], "dtype": "float32" },
        { "name": "dense_2/kernel", "shape": [128, 7], "dtype": "float32" },
        { "name": "dense_2/bias", "shape": [7], "dtype": "float32" }
      ]
    }
  ]
}
